import React from 'react';

const Policy = () => {
  return (
    <div className="max-w-4xl mx-auto p-6 sm:p-8 text-gray-800">
      <h1 className="text-2xl md:text-3xl font-bold mb-4 text-center">Политика конфиденциальности</h1>
      <p className="text-center text-gray-500 mb-6">Дата вступления в силу: 21.08.2024</p>

      <p className="mb-4">
        Добро пожаловать в <strong>KOT.dev</strong>!
      </p>
      <p className="mb-6">
        Настоящая Политика конфиденциальности описывает, как мы собираем, используем, раскрываем и
        защищаем ваши данные при использовании наших услуг по разработке сайтов и настройке рекламы
        Google Ads. Пожалуйста, внимательно прочитайте эту Политику конфиденциальности. Если вы не
        согласны с ее условиями, просим не использовать наши услуги.
      </p>

      <h2 className="text-xl font-semibold mb-3">1. Информация, которую мы собираем:</h2>
      <h3 className="text-lg font-medium mb-2">a. Личные данные</h3>
      <p className="mb-4">
        Контактные данные: При обращении к нам через форму на сайте или по электронной почте, мы
        можем собирать такие данные, как ваше имя, адрес электронной почты, номер телефона и другую
        информацию, необходимую для связи.
      </p>

      <h3 className="text-lg font-medium mb-2">b. Данные взаимодействия</h3>
      <p className="mb-4">
        Информация о проектах: Мы собираем информацию, которую вы предоставляете о вашем бизнесе,
        проекте или рекламных кампаниях для разработки сайта или настройки рекламы.
      </p>
      <p className="mb-6">
        Аналитические данные: Мы можем собирать данные о том, как вы используете наш сайт или как
        взаимодействуете с рекламными кампаниями Google Ads, включая логи и статистику
        использования.
      </p>

      <h2 className="text-xl font-semibold mb-3">2. Как мы используем вашу информацию:</h2>
      <p className="mb-4">
        Разработка и настройка: Для оказания услуг по созданию сайтов на заказ и настройки рекламных
        кампаний Google Ads.
      </p>
      <p className="mb-6">
        Обратная связь: Для связи с вами по вопросам проекта, предоставления поддержки и обновлений
        по услугам.
      </p>

      <h2 className="text-xl font-semibold mb-3">3. Раскрытие вашей информации:</h2>
      <p className="mb-6">
        Мы не продаём и не сдаём ваши личные данные в аренду третьим лицам. Однако мы можем
        передавать вашу информацию в следующих случаях: Поставщики услуг: Мы можем делиться данными
        с третьими лицами, которые помогают нам в работе, например, поставщиками услуг хостинга или
        аналитики.
      </p>

      <h2 className="text-xl font-semibold mb-3">4. Защита данных:</h2>
      <p className="mb-6">
        Мы применяем соответствующие технические и организационные меры для защиты ваших данных от
        несанкционированного доступа, изменения, раскрытия или уничтожения. Однако следует помнить,
        что ни один способ передачи данных через интернет не может быть полностью безопасным.
      </p>

      <h2 className="text-xl font-semibold mb-3">5. Ваши права:</h2>
      <p className="mb-4">
        Доступ: Вы можете запросить доступ к своим личным данным, которые мы храним.
      </p>
      <p className="mb-6">
        Исправление: Вы имеете право запросить исправление неточной информации. Удаление: Вы можете
        запросить удаление ваших данных, если это не противоречит нашим правовым обязательствам.
      </p>

      <h2 className="text-xl font-semibold mb-3">6. Cookies и технологии отслеживания:</h2>
      <p className="mb-6">
        Наш сайт использует cookies и аналогичные технологии для улучшения функциональности, анализа
        использования и предоставления персонализированного контента. Вы можете управлять своими
        настройками cookies через настройки браузера.
      </p>

      <h2 className="text-xl font-semibold mb-3">7. Ссылки на сторонние сайты:</h2>
      <p className="mb-6">
        Наш сайт может содержать ссылки на сторонние сайты, которые не контролируются нами. Мы не
        несем ответственности за политику конфиденциальности и содержание этих сайтов. Рекомендуем
        ознакомиться с их условиями использования и политикой конфиденциальности.
      </p>

      <h2 className="text-xl font-semibold mb-3">8. Изменения в Политике конфиденциальности:</h2>
      <p className="mb-6">
        Мы можем обновлять данную Политику конфиденциальности по мере необходимости для отражения
        изменений в наших услугах или юридических требованиях. Обновленная политика будет
        опубликована на этой странице, и мы уведомим вас о существенных изменениях.
      </p>

      <h2 className="text-xl font-semibold mb-3">9. Контакты:</h2>
      <p className="mb-6">
        Если у вас возникли вопросы или замечания по поводу данной Политики конфиденциальности или
        наших методов обработки данных, свяжитесь с нами:
      </p>

      <p className="text-center font-bold">
        <strong>KOT.dev</strong> <br />
        Электронная почта: [ваш контактный email] <br />© 2024 Все права защищены.
      </p>
    </div>
  );
};

export default Policy;
